Revit 2026 API

# OutlineContainsOtherOutline Method

---

Determine if this Outline contains another Outline to within tolerance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ContainsOtherOutline(
	Outline otherOutline,
	double tolerance
)
```
```vb
Public Function ContainsOtherOutline (
	otherOutline As Outline,
	tolerance As Double
) As Boolean
```
```cpp
public:
bool ContainsOtherOutline(
	Outline^ otherOutline,
	double tolerance
)
```
```fsharp
member ContainsOtherOutline :
        otherOutline : Outline *
        tolerance : float -> bool
```

#### Parameters

otherOutline Outline
     The outline to test for containment.
tolerance Double
     The tolerance to use when determining whether the point is contained. Defaults to zero.

#### Return Value

Boolean True if this outline contains the given outline, or false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the tolerance is positive, the other Outline may extend the tolerance distance outside of this Outline in each coordinate. If the tolerance is negative, the other Outline must lie at least the tolerance distance inside of this Outline in each coordinate to be a match.

#### Reference

Outline Class

Autodesk.Revit.DB Namespace